<template>
    <div class="container-fluid">
        <div class="row">
            <HeaderCatalog></HeaderCatalog>
        </div>

        <div class="container_main">
               <div class="about_company_block">
                   <div class="row">
                       <div class="col-xs-12 col-md-7">
                           <div class="abot_company">
                               <h1 class="title_about_company">Продовольственная<br />торговая платформа B2B</h1>
                           </div>
                           <div class="description_about_company">
                               Disfood Market – это профессиональная платформа, в которой можно купить и продать продукты
                               питания
                               оптом, получить рекомендацию по цене и продвинуть свой товар
                           </div>
                           <div class="btn_about_company">
                               <router-link class="btn_register" to="/authorization">Зарегистрироваться</router-link>
                               <a class="btn_learn_more" href="/#user_registration">Узнать подробнее</a>
                           </div>
                       </div>
                       <div class="col-xs-12 col-md-5">
                           <div class="corn">
                               <div class="img_corn">
                                   <svg width="345" height="345" viewBox="0 0 345 345" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                       <path
                                           d="M341.826 326.714L294.497 279.384C327.197 231.194 309.449 196.773 287.935 176.013C284.708 172.893 280.083 172.248 276.211 173.861C271.693 161.814 263.948 151.702 255.665 143.743C252.438 140.623 247.813 139.978 243.94 141.591C239.423 129.544 231.678 119.432 223.395 111.472C220.168 108.353 215.543 107.708 211.67 109.321C207.153 97.2737 199.408 87.27 191.125 79.2024C186.93 75.1149 180.153 75.2225 176.066 79.31C167.568 87.8078 161.652 97.0585 157.887 106.74C146.808 94.1542 128.199 86.9473 97.6497 86.9473C91.7335 86.9473 86.893 91.7878 86.893 97.7039C86.893 128.253 94.0999 146.862 106.685 157.941C97.6497 161.491 88.2913 167.085 79.2557 176.12C75.0606 180.315 75.0606 186.984 79.1482 191.179C87.1081 199.462 97.2194 207.207 109.267 211.725C107.653 215.597 108.299 220.223 111.418 223.45C119.378 231.732 129.489 239.477 141.537 243.995C139.923 247.867 140.569 252.493 143.688 255.72C151.648 264.002 161.759 271.747 173.807 276.265C172.193 280.137 172.839 284.763 175.958 287.99C188.544 301.005 205.969 312.622 228.558 312.622C243.403 312.622 260.291 307.567 279.438 294.551L326.767 341.881C328.918 344.032 331.607 345 334.404 345C337.201 345 339.89 343.924 342.041 341.881C346.021 337.793 346.021 331.016 341.826 326.714ZM279.007 263.895L262.227 247.114C274.274 229.366 279.438 213.446 280.191 199.462C295.25 218.609 294.82 239.047 279.007 263.895ZM167.138 247.975C181.121 247.329 197.041 242.166 214.79 230.119L231.463 246.792C206.722 262.711 186.177 263.142 167.138 247.975ZM182.52 197.849L199.193 214.521C174.452 230.334 153.907 230.764 134.868 215.705C148.959 215.059 164.771 209.896 182.52 197.849ZM246.737 231.625L229.957 214.844C242.004 197.096 247.167 181.176 247.92 167.192C262.98 186.339 262.55 206.777 246.737 231.625ZM214.467 199.355L197.687 182.574C209.734 164.826 214.897 148.906 215.65 134.922C230.71 154.069 230.28 174.507 214.467 199.355ZM183.918 103.297C198.332 121.906 198.009 141.806 183.165 165.794C173.054 149.121 168.966 124.703 183.918 103.297ZM151.11 151.272C122.82 149.766 110.773 140.838 108.729 108.891C140.676 110.827 149.604 122.982 151.11 151.272ZM138.525 174.291C147.991 175.044 157.564 178.164 165.739 183.22C141.752 198.171 121.852 198.386 103.243 183.973C116.151 174.937 129.167 173.539 138.525 174.291ZM199.408 280.245C213.392 279.599 229.311 274.436 247.06 262.389L263.733 279.062C238.992 294.981 218.447 295.304 199.408 280.245Z"
                                           fill="#51668F" />
                                       <path
                                           d="M19.1214 4.00967C14.9262 -0.185434 8.14954 -0.185434 3.95443 4.00967C-0.240671 8.20478 -0.240671 14.9815 3.95443 19.1766L57.7378 72.96C59.8892 75.1113 62.5784 76.0794 65.3751 76.0794C68.1718 76.0794 70.861 75.0038 73.0123 72.96C77.2074 68.7649 77.2074 61.9882 73.0123 57.7931L19.1214 4.00967Z"
                                           fill="#51668F" />
                                       <path
                                           d="M133.039 73.071C135.19 75.2224 137.879 76.1905 140.676 76.1905C143.473 76.1905 146.162 75.1148 148.313 73.071C152.508 68.8759 152.508 62.0992 148.313 57.9041L94.5298 4.12069C90.3347 -0.074411 83.558 -0.074411 79.3629 4.12069C75.1678 8.3158 75.1678 15.0925 79.3629 19.2876L133.039 73.071Z"
                                           fill="#51668F" />
                                       <path
                                           d="M19.1253 79.3099C14.9302 75.1148 8.15345 75.1148 3.95834 79.3099C-0.236765 83.5051 -0.236765 90.2818 3.95834 94.4769L57.7417 148.26C59.8931 150.412 62.5823 151.38 65.379 151.38C68.1757 151.38 70.8649 150.304 73.0162 148.26C77.2113 144.065 77.2113 137.288 73.0162 133.093L19.1253 79.3099Z"
                                           fill="#51668F" />
                                   </svg>
                                       <div class="play_company">
                                           <a href="#videoModal" class="" data-toggle="modal">
                                           <svg width="125" height="125" viewBox="0 0 125 125" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                               <path fill-rule="evenodd" clip-rule="evenodd"
                                                     d="M62.5 0C27.9822 0 0 27.9822 0 62.5C0 97.0178 27.9822 125 62.5 125C97.0178 125 125 97.0178 125 62.5C125 27.9822 97.0178 0 62.5 0ZM53.9443 84.2469L85.6111 65.9641C88.2777 64.4245 88.2777 60.5755 85.6111 59.0359L53.9443 40.7531C51.2777 39.2135 47.9443 41.138 47.9443 44.2172L47.9443 80.7828C47.9443 83.862 51.2777 85.7865 53.9443 84.2469Z"
                                                     fill="#71BF45" />
                                           </svg>
                                           </a>
                                           <div>
                                               О компании<br />и платформе
                                           </div>
                                       </div>

                               </div>
                           </div>
                       </div>
                   </div>
               </div>
               <div class="search_company_block">
                   <div class="title_search_company_block">Найти товар</div>
                   <div class="container_btn_search__company">
                       <div class="search_header">
                          <search-bar></search-bar>
                       </div>
                       <div class="btn_search_company">
                           Найти товары и поставщиков
                       </div>
                   </div>
                   <div class="search_category_company" v-if="categories" id="user_registration">
                       <div class="item_search_category_company" v-for="cat in categories" @click="goToCategory(cat)">
                          {{cat.name}}
                       </div>
                   </div>
               </div>
               <div class="user_registration_company_block">
                   <div class="title_user_registration_company_block">Упрощаем процессы проведения сделок</div>
                   <div class="row">
                       <div class="col-xs-12 col-md-6">
                           <div class="item_user_registration_company">
                               <div class="left_item_user_registration_company">
                                   <div>
                                       <div class="title_item_user_registration_company">Покупателям</div>
                                       <div class="text_item_user_registration_company">
                                           Лучшая цена на рынке, без посредников<br />и сложных цепочек оформления сделки
                                       </div>
                                       <div class="list_user_registration_company">
                                           <div class="item_list_user_registration_company">
                                               <div class="icon_item_list_user_registration_company"></div>
                                               <div>
                                                   <div class="title_item_list_user_registration_company">Проверенные
                                                       поставщики и товары</div>
                                                   <div class="text_item_list_user_registration_company">
                                                       Все поставщики представленые на платформе проверены,
                                                       аккредитованы и имеют необходимую документацию
                                                   </div>
                                               </div>
                                           </div>
                                           <div class="item_list_user_registration_company">
                                               <div class="icon_item_list_user_registration_company"></div>
                                               <div>
                                                   <div class="title_item_list_user_registration_company">Сделка за 24 часа
                                                   </div>
                                                   <div class="text_item_list_user_registration_company">
                                                       Платформа выступает гарантом для обеих сторон, ведением сделки
                                                       занимается менеджер Disfood. За статусом сделки можно следить в
                                                       личном кабинете
                                                   </div>
                                               </div>
                                           </div>
                                           <div class="item_list_user_registration_company">
                                               <div class="icon_item_list_user_registration_company"></div>
                                               <div>
                                                   <div class="title_item_list_user_registration_company">Полное сопровождение
                                                       сделки</div>
                                                   <div class="text_item_list_user_registration_company">
                                                       Подготовим необходимую экспортную документацию. Оформим логистику до
                                                       вашего склада
                                                   </div>
                                               </div>
                                           </div>
                                           <div class="item_list_user_registration_company">
                                               <div class="icon_item_list_user_registration_company"></div>
                                               <div>
                                                   <div class="title_item_list_user_registration_company">Прямая связь с
                                                       поддержкой</div>
                                                   <div class="text_item_list_user_registration_company">
                                                       Менеджеры Disfood Market всегда помогут разобраться в любый вопросах,
                                                       проконсультируют по товарам и услугам
                                                   </div>
                                               </div>
                                           </div>
                                       </div>
                                   </div>
                                   <div class="icon_item_user_registration_company">
                                       <svg width="81" height="81" viewBox="0 0 81 81" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                           <path
                                               d="M37.9666 33.6717L29.7401 19.4229C28.9026 17.9695 28.6764 16.2431 29.1112 14.623C29.546 13.0029 30.6063 11.6218 32.059 10.7831C33.5117 9.94436 35.2379 9.71673 36.8583 10.1502C38.4788 10.5837 39.8608 11.6428 40.7007 13.0947L53.357 35.016"
                                               stroke="#51668F" stroke-width="6" stroke-linecap="round"
                                               stroke-linejoin="round" />
                                           <path
                                               d="M28.2715 42.192L16.2481 21.3668C15.8318 20.647 15.5613 19.8523 15.4523 19.028C15.3433 18.2038 15.3977 17.3661 15.6126 16.5628C15.8274 15.7596 16.1985 15.0066 16.7045 14.3469C17.2106 13.6871 17.8416 13.1335 18.5617 12.7178C19.2818 12.3021 20.0767 12.0323 20.9011 11.924C21.7255 11.8156 22.5631 11.8708 23.3662 12.0863C24.1692 12.3018 24.9219 12.6735 25.5812 13.1801C26.2406 13.6867 26.7936 14.3182 27.2087 15.0386L37.9665 33.6717"
                                               stroke="#51668F" stroke-width="6" stroke-linecap="round"
                                               stroke-linejoin="round" />
                                           <path
                                               d="M48.7245 52.3048C47.0461 49.3978 46.5913 45.9433 47.4601 42.701C48.3289 39.4587 50.45 36.6944 53.357 35.016L50.1929 29.5357C49.7766 28.816 49.5062 28.0213 49.3971 27.197C49.2881 26.3727 49.3425 25.535 49.5574 24.7318C49.7723 23.9286 50.1433 23.1755 50.6493 22.5158C51.1554 21.856 51.7864 21.3025 52.5065 20.8867C53.2266 20.471 54.0215 20.2013 54.8459 20.0929C55.6703 19.9846 56.5079 20.0397 57.311 20.2553C58.114 20.4708 58.8667 20.8425 59.526 21.349C60.1854 21.8556 60.7384 22.4872 61.1535 23.2076L67.4817 34.1682C69.1446 37.047 70.2241 40.2252 70.6586 43.5212C71.0931 46.8173 70.874 50.1666 70.0139 53.378C69.1538 56.5894 67.6696 59.5998 65.6458 62.2375C63.6221 64.8752 61.0986 67.0884 58.2195 68.7506C55.3403 70.4129 52.1619 71.4917 48.8658 71.9255C45.5696 72.3593 42.2203 72.1394 39.0091 71.2786C35.798 70.4178 32.7878 68.9328 30.1506 66.9085C27.5134 64.8842 25.3008 62.3602 23.6391 59.4807L11.6157 38.6555C10.7782 37.2021 10.552 35.4757 10.9868 33.8556C11.4217 32.2356 12.4819 30.8544 13.9346 30.0157C15.3873 29.177 17.1135 28.9494 18.7339 29.3828C20.3544 29.8163 21.7364 30.8754 22.5763 32.3274L28.2716 42.192"
                                               stroke="#51668F" stroke-width="6" stroke-linecap="round"
                                               stroke-linejoin="round" />
                                           <path
                                               d="M55.6875 7.27423C59.0204 7.27379 62.2947 8.15114 65.1808 9.81801C68.067 11.4849 70.4632 13.8825 72.1284 16.7696"
                                               stroke="#51668F" stroke-width="6" stroke-linecap="round"
                                               stroke-linejoin="round" />
                                           <path d="M21.1788 75.9376C17.7764 73.0852 14.9018 69.657 12.6862 65.8094"
                                                 stroke="#51668F" stroke-width="6" stroke-linecap="round"
                                                 stroke-linejoin="round" />
                                       </svg>
                                   </div>
                               </div>
                               <div class="btn_user_registration_company">
                                   <router-link to="/authorization">Зарегистрироваться</router-link>
                               </div>
                           </div>
                       </div>
                       <div class="col-xs-12 col-md-6">
                           <div class="item_user_registration_company active">
                               <div class="left_item_user_registration_company">
                                   <div>
                                       <div class="title_item_user_registration_company">Поставщикам</div>
                                       <div class="text_item_user_registration_company">
                                           Обеспечим время проведения<br />сделки до 24 часов
                                       </div>
                                       <div class="list_user_registration_company">
                                           <div class="item_list_user_registration_company">
                                               <div class="icon_item_list_user_registration_company"></div>
                                               <div>
                                                   <div class="title_item_list_user_registration_company">Удобное управление
                                                       сделками</div>
                                                   <div class="text_item_list_user_registration_company">
                                                       Все заявки и сделки хранятся в вашем личном кабинете. Оперативно
                                                       управляйте вашим складом и обновлением цен
                                                   </div>
                                               </div>
                                           </div>
                                           <div class="item_list_user_registration_company">
                                               <div class="icon_item_list_user_registration_company"></div>
                                               <div>
                                                   <div class="title_item_list_user_registration_company">Сделка за 24 часа
                                                   </div>
                                                   <div class="text_item_list_user_registration_company">
                                                       Платформа выступает гарантом для обеих сторон, ведением сделки
                                                       занимается менеджер Disfood. За статусом сделки можно следить в
                                                       личном кабинете
                                                   </div>
                                               </div>
                                           </div>
                                           <div class="item_list_user_registration_company">
                                               <div class="icon_item_list_user_registration_company"></div>
                                               <div>
                                                   <div class="title_item_list_user_registration_company">Полное сопровождение
                                                       сделки</div>
                                                   <div class="text_item_list_user_registration_company">
                                                       Подготовим необходимую экспортную документацию. Оформим логистику до
                                                       склада вашего заказчика
                                                   </div>
                                               </div>
                                           </div>
                                           <div class="item_list_user_registration_company">
                                               <div class="icon_item_list_user_registration_company"></div>
                                               <div>
                                                   <div class="title_item_list_user_registration_company">Бесплатное размещение
                                                       в каталоге</div>
                                                   <div class="text_item_list_user_registration_company">
                                                       После акредитации ваши товары появятся в общем каталоге. Принимайте
                                                       заявки и продвигайте товары
                                                   </div>
                                               </div>
                                           </div>
                                       </div>
                                   </div>
                                   <div class="icon_item_user_registration_company">
                                       <svg width="80" height="80" viewBox="0 0 80 80" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                           <path
                                               d="M80 35.0935C80 22.776 75.3123 17.8889 72.5446 16.0937C72.6194 13.7249 72.3452 9.58586 69.7021 6.44416C67.483 3.80113 64.1917 2.47963 59.9529 2.47963C55.2902 2.47963 51.9989 4.10032 49.68 6.3444C41.5016 -0.711977 31.0292 -1.23556 23.7983 1.63188C17.0162 4.32477 12.8771 9.88504 12.553 16.6173C8.06485 18.5372 4.39952 22.0779 2.20531 26.8902C-1.36027 34.7445 -0.138499 44.1197 5.24728 51.0015C3.60163 53.2207 2.50452 56.113 2.50452 59.9529C2.50452 64.2166 3.85097 67.483 6.46906 69.7022C9.61077 72.3452 13.7748 72.6195 16.1186 72.5447C17.9139 75.2875 22.801 80 35.1184 80C42.3493 80 47.411 77.5315 50.8519 74.6392C51.9241 74.7638 52.9713 74.8386 54.0186 74.8386C60.1025 74.8386 65.4135 72.794 69.2783 68.8794C73.7166 64.3912 75.5866 58.008 74.689 50.827C77.5315 47.3611 80 42.3244 80 35.0935ZM59.9529 7.46647C62.6458 7.46647 64.6405 8.18954 65.8872 9.63573C68.231 12.4034 67.483 17.0661 67.483 17.116C67.2835 18.3128 68.0316 19.5097 69.1785 19.9086C69.4279 19.9834 75.0131 22.0779 75.0131 35.0935C75.0131 42.4491 71.8714 46.9373 68.9791 49.5304C69.5775 47.2614 69.9266 44.9176 69.9266 42.4741C69.9266 40.4544 69.7021 38.5095 69.2783 36.6394C69.5027 36.3901 69.6772 36.1158 69.8019 35.7917L72.2953 28.3114C72.7192 27.0148 72.021 25.5936 70.7244 25.1698C69.4029 24.7209 68.0066 25.444 67.5827 26.7405L66.6602 29.4833C65.0145 26.4413 62.7954 23.7236 60.1773 21.5044L62.2967 13.0517C62.6208 11.7053 61.8229 10.3588 60.4765 10.0347C59.1301 9.68561 57.7836 10.5084 57.4595 11.8548L55.8138 18.4873C54.0185 17.49 52.0986 16.717 50.1039 16.1435C50.5527 13.301 52.4976 7.46647 59.9529 7.46647ZM42.499 64.9148C32.65 64.9148 24.297 58.5316 21.28 49.7299C22.0529 49.306 22.6015 48.5081 22.6015 47.5856C22.6015 44.3441 23.8981 42.5987 25.0949 42.5987C26.4663 42.5987 27.5883 41.4767 27.5883 40.1053C27.5883 38.7339 26.4663 37.6119 25.0949 37.6119C23.3495 37.6119 21.6041 38.3849 20.2327 39.8809C21.255 31.0542 27.4138 23.7983 35.6421 21.1304C35.293 22.3023 35.0686 23.6238 35.0686 25.1448C35.0686 26.5162 36.1906 27.6382 37.562 27.6382C38.9334 27.6382 40.0554 26.5162 40.0554 25.1448C40.0554 21.9033 41.352 20.158 42.5488 20.158C42.6984 20.158 42.8231 20.1081 42.9478 20.0832C55.1157 20.3325 64.9397 30.2812 64.9397 42.499C64.9397 54.8414 54.8663 64.9148 42.499 64.9148ZM6.74334 28.9099C9.26169 23.3745 14.0989 20.1081 20.0333 19.9336C21.4046 19.8837 22.5017 18.7367 22.4519 17.3653C22.402 15.994 21.2301 14.8969 19.8837 14.9467C19.1356 14.9717 18.4375 15.0714 17.7144 15.1711C18.4873 11.1817 21.28 7.99006 25.6434 6.2696C31.3284 4.02552 40.1053 4.47432 46.7378 10.3837C45.9149 12.0044 45.4163 13.6751 45.142 15.1961C44.2693 15.1213 43.3966 15.0714 42.499 15.0714C40.6289 15.0714 38.7838 15.2708 37.0134 15.6199L34.9439 9.38637C34.52 8.08979 33.0988 7.36669 31.7773 7.81551C30.4807 8.23939 29.7576 9.66066 30.2064 10.9572L32.251 17.0661C25.3442 19.8588 19.8338 25.3692 17.0661 32.3009L10.9323 30.2563C9.61077 29.8075 8.21445 30.5306 7.76564 31.8271C7.34176 33.1237 8.03991 34.545 9.33649 34.9689L15.6199 37.0633C15.2708 38.8087 15.0714 40.629 15.0714 42.4741C15.0714 43.3717 15.1212 44.2444 15.196 45.1171C13.2262 45.4662 10.9572 46.2391 8.91261 47.5606C4.87327 42.1748 4.00058 34.9689 6.74334 28.9099ZM19.9585 69.2284C19.6094 68.0066 18.3876 67.2337 17.1409 67.4581C17.091 67.4581 12.4283 68.1812 9.68557 65.8872C8.21445 64.6405 7.49136 62.6957 7.49136 59.9529C7.49136 52.4726 13.2761 50.5527 16.1435 50.054C16.7419 52.0986 17.5398 54.0684 18.5621 55.8886L11.9546 57.5343C10.6081 57.8584 9.81024 59.2299 10.1344 60.5514C10.4087 61.6734 11.431 62.4463 12.553 62.4463C12.7525 62.4463 12.9519 62.4214 13.1514 62.3715L21.5792 60.2521C23.7734 62.8452 26.4413 65.0145 29.4584 66.6352L26.7156 67.5579C25.419 67.9818 24.6959 69.4029 25.1448 70.6995C25.4938 71.7468 26.4663 72.3951 27.5135 72.3951C27.7629 72.3951 28.0371 72.3452 28.3114 72.2704L35.7917 69.777C36.1158 69.6772 36.415 69.5027 36.6644 69.2783C38.5344 69.6773 40.4793 69.9017 42.499 69.9017C44.9425 69.9017 47.3113 69.5526 49.5553 68.9542C46.9622 71.8465 42.4491 74.9882 35.1184 74.9882C22.1277 74.9882 20.0333 69.403 19.9585 69.2284ZM65.7127 65.3885C63.0697 68.0565 59.4542 69.5526 55.2154 69.8019C56.6117 67.7075 57.26 66.0618 57.3099 65.8623C57.3597 65.7376 57.3348 65.613 57.3597 65.5132C60.6261 63.3938 63.3938 60.6261 65.5132 57.3597C65.6379 57.3348 65.7626 57.3348 65.8872 57.2849C66.0867 57.2101 67.7573 56.5619 69.9016 55.1406C69.7021 59.2298 68.2809 62.7704 65.7127 65.3885Z"
                                               fill="#51668F" />
                                           <path
                                               d="M50.0292 35.0935C50.0292 31.8521 51.3258 30.1067 52.5226 30.1067C53.894 30.1067 55.016 28.9847 55.016 27.6133C55.016 26.2419 53.894 25.1199 52.5226 25.1199C48.8074 25.1199 45.0424 28.5359 45.0424 35.0935C45.0424 36.4649 46.1644 37.587 47.5358 37.587C48.9072 37.587 50.0292 36.4899 50.0292 35.0935Z"
                                               fill="#51668F" />
                                           <path
                                               d="M35.0686 42.5738C35.0686 39.3324 36.3652 37.587 37.562 37.587C38.9334 37.587 40.0555 36.465 40.0555 35.0936C40.0555 33.7222 38.9334 32.6002 37.562 32.6002C33.8468 32.6002 30.0818 36.0161 30.0818 42.5738C30.0818 43.9452 31.2038 45.0673 32.5752 45.0673C33.9466 45.0673 35.0686 43.9701 35.0686 42.5738Z"
                                               fill="#51668F" />
                                           <path
                                               d="M40.0556 47.5606C36.3404 47.5606 32.5753 50.9766 32.5753 57.5343C32.5753 58.9057 33.6974 60.0277 35.0687 60.0277C36.4401 60.0277 37.5622 58.9057 37.5622 57.5343C37.5622 54.2928 38.8587 52.5474 40.0556 52.5474C41.427 52.5474 42.549 51.4254 42.549 50.054C42.549 48.6826 41.427 47.5606 40.0556 47.5606Z"
                                               fill="#51668F" />
                                           <path
                                               d="M55.016 42.5739C51.3008 42.5739 47.5358 45.9898 47.5358 52.5475C47.5358 53.9189 48.6578 55.0409 50.0292 55.0409C51.4006 55.0409 52.5226 53.9189 52.5226 52.5475C52.5226 49.3061 53.8192 47.5607 55.016 47.5607C56.3874 47.5607 57.5094 46.4387 57.5094 45.0673C57.5094 43.6959 56.3874 42.5739 55.016 42.5739Z"
                                               fill="#51668F" />
                                       </svg>

                                   </div>
                               </div>
                               <div class="btn_user_registration_company">

                                   <router-link to="/authorization">Стать поставщиком</router-link>
                               </div>
                           </div>
                       </div>
                   </div>
               </div>
               <div class="delivery_company_block">
                   <div class="img_car" style="background-image: url('./images/car.png');"></div>
                   <div class="row">
                       <div class="col-md-4">
                           <div class="title_delivery_company">Доставляем товары<br />по всей России </div>
                           <div class="type_delivery_company">ЖД, Авто, Самовывоз</div>
                           <div class="description_delivery_company">
                               <p>Мгновенный расчет доставки до вашего склада. Менеджеры Disfood оформят сопроводительную
                                   документацию и логистику.</p>
                               <p>Либо вы можете самостоятельно забрать заказ со склада поставщика</p>
                           </div>
                       </div>
                   </div>
               </div>
               <div class="advantages_company_block">
                   <div class="title_advantages_company_block">Плюс ко всему: дополнительные возможности</div>
                   <div class="row">
                       <div class="col-xs-12 col-md-3">
                           <div class="item_advantages_company">
                               <div class="img_item_advantages_company">
                                   <svg width="88" height="81" viewBox="0 0 88 81" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                       <rect x="31" width="57" height="57" rx="28.5" fill="#CAE7BA" />
                                       <path
                                           d="M75.5 38.5H55.5V26H68.8074C69.3071 26 69.7953 26.1497 70.209 26.4298C70.6227 26.7099 70.943 27.1076 71.1286 27.5715L75.5 38.5Z"
                                           stroke="#51668F" stroke-width="6" stroke-linecap="round" stroke-linejoin="round" />
                                       <path d="M5.5 46H55.5" stroke="#51668F" stroke-width="6" stroke-linecap="round"
                                             stroke-linejoin="round" />
                                       <path
                                           d="M59.25 68.5C63.3921 68.5 66.75 65.1421 66.75 61C66.75 56.8579 63.3921 53.5 59.25 53.5C55.1079 53.5 51.75 56.8579 51.75 61C51.75 65.1421 55.1079 68.5 59.25 68.5Z"
                                           stroke="#51668F" stroke-width="6" stroke-miterlimit="10" />
                                       <path
                                           d="M21.75 68.5C25.8921 68.5 29.25 65.1421 29.25 61C29.25 56.8579 25.8921 53.5 21.75 53.5C17.6079 53.5 14.25 56.8579 14.25 61C14.25 65.1421 17.6079 68.5 21.75 68.5Z"
                                           stroke="#51668F" stroke-width="6" stroke-miterlimit="10" />
                                       <path d="M51.75 61H29.25" stroke="#51668F" stroke-width="6" stroke-linecap="round"
                                             stroke-linejoin="round" />
                                       <path
                                           d="M14.25 61H8C7.33696 61 6.70107 60.7366 6.23223 60.2678C5.76339 59.7989 5.5 59.163 5.5 58.5V23.5C5.5 22.837 5.76339 22.2011 6.23223 21.7322C6.70107 21.2634 7.33696 21 8 21H55.5V54.5047"
                                           stroke="#51668F" stroke-width="6" stroke-linecap="round" stroke-linejoin="round" />
                                       <path
                                           d="M55.5 54.5047V38.5H75.5V58.5C75.5 59.163 75.2366 59.7989 74.7678 60.2678C74.2989 60.7366 73.663 61 73 61H66.75"
                                           stroke="#51668F" stroke-width="6" stroke-linecap="round" stroke-linejoin="round" />
                                   </svg>
                               </div>
                               <div class="text_item_advantages_company">Занимаемся логистикой<br />до вашего склада</div>
                           </div>
                       </div>
                       <div class="col-xs-12 col-md-3">
                           <div class="item_advantages_company">
                               <div class="img_item_advantages_company">
                                   <svg width="88" height="81" viewBox="0 0 88 81" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                       <rect x="31" width="57" height="57" rx="28.5" fill="#CAE7BA" />
                                       <path
                                           d="M68.0024 23.5H13.0024C11.6217 23.5 10.5024 24.6193 10.5024 26V66C10.5024 67.3807 11.6217 68.5 13.0024 68.5H68.0024C69.3832 68.5 70.5024 67.3807 70.5024 66V26C70.5024 24.6193 69.3832 23.5 68.0024 23.5Z"
                                           stroke="#51668F" stroke-width="6" stroke-linecap="round" stroke-linejoin="round" />
                                       <path
                                           d="M53 23.5V18.5C53 17.1739 52.4732 15.9021 51.5355 14.9645C50.5979 14.0268 49.3261 13.5 48 13.5H33C31.6739 13.5 30.4021 14.0268 29.4645 14.9645C28.5268 15.9021 28 17.1739 28 18.5V23.5"
                                           stroke="#51668F" stroke-width="6" stroke-linecap="round" stroke-linejoin="round" />
                                       <path
                                           d="M70.5026 40.4714C61.3847 45.7466 51.0339 48.5164 40.5 48.4998C29.968 48.5164 19.6188 45.7475 10.5021 40.4741"
                                           stroke="#51668F" stroke-width="6" stroke-linecap="round" stroke-linejoin="round" />
                                       <path d="M36.75 38.5H44.25" stroke="#51668F" stroke-width="6" stroke-linecap="round"
                                             stroke-linejoin="round" />
                                   </svg>
                               </div>
                               <div class="text_item_advantages_company">Подготавливаем экспортную документацию</div>
                           </div>
                       </div>
                       <div class="col-xs-12 col-md-3">
                           <div class="item_advantages_company">
                               <div class="img_item_advantages_company">
                                   <svg width="88" height="81" viewBox="0 0 88 81" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                       <rect x="31" width="57" height="57" rx="28.5" fill="#CAE7BA" />
                                       <path
                                           d="M13 34.3333V16C13 15.337 13.2634 14.7011 13.7322 14.2322C14.2011 13.7634 14.837 13.5 15.5 13.5H65.5C66.163 13.5 66.7989 13.7634 67.2678 14.2322C67.7366 14.7011 68 15.337 68 16V34.3333C68 60.5881 45.7169 69.2865 41.2676 70.7616C40.7702 70.9328 40.2298 70.9328 39.7324 70.7616C35.2831 69.2865 13 60.5881 13 34.3333Z"
                                           stroke="#51668F" stroke-width="6" stroke-linecap="round" stroke-linejoin="round" />
                                       <path d="M54.25 31L35.9166 48.5L26.75 39.75" stroke="#51668F" stroke-width="6"
                                             stroke-linecap="round" stroke-linejoin="round" />
                                   </svg>
                               </div>
                               <div class="text_item_advantages_company">Прогнозируем<br />цены на товары</div>
                           </div>
                       </div>
                       <div class="col-xs-12 col-md-3">
                           <div class="item_advantages_company">
                               <div class="img_item_advantages_company">
                                   <svg width="88" height="81" viewBox="0 0 88 81" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                       <rect x="31" width="57" height="57" rx="28.5" fill="#CAE7BA" />
                                       <path d="M40.5 41V11" stroke="#51668F" stroke-width="6" stroke-linecap="round"
                                             stroke-linejoin="round" />
                                       <path d="M66.4807 26L14.5192 56" stroke="#51668F" stroke-width="6"
                                             stroke-linecap="round" stroke-linejoin="round" />
                                       <path
                                           d="M40.5 11C45.7561 11.001 50.9197 12.3828 55.4736 15.0072C60.0276 17.6316 63.8122 21.4063 66.4484 25.9535C69.0845 30.5007 70.4798 35.6606 70.4944 40.9167C70.509 46.1727 69.1424 51.3403 66.5316 55.9021C63.9207 60.4638 60.1571 64.2595 55.6178 66.9092C51.0785 69.5588 45.9227 70.9693 40.6667 70.9995C35.4107 71.0297 30.2391 69.6784 25.6696 67.0811C21.1002 64.4838 17.2933 60.7315 14.6302 56.2"
                                           stroke="#51668F" stroke-width="6" stroke-linecap="round" stroke-linejoin="round" />
                                       <path
                                           d="M27.9982 34.1706L10.6663 44.177C10.5553 43.1216 10.4998 42.0611 10.5 40.9998C10.4991 35.2549 12.1475 29.6304 15.2493 24.7948C18.3511 19.9591 22.7759 16.1156 27.998 13.7209L27.9982 34.1706Z"
                                           stroke="#51668F" stroke-width="6" stroke-linecap="round" stroke-linejoin="round" />
                                   </svg>
                               </div>
                               <div class="text_item_advantages_company">Выступаем гарантом<br />для обеих сторон</div>
                           </div>
                       </div>
                   </div>
               </div>
               <div class="become_partner_company_block">
                   <div class="row">
                       <div class="col-xs-12 col-md-4">
                           <div class="title_become_partner_company">Ответственно отбираем лучших поставщиков товаров</div>
                           <div class="text_become_partner_company">
                               Чтобы стать нашим поставщиком необходимо пройти регистрацию и соответствовать нашим требованиям:
                           </div>
                           <div class="btn_user_registration_company">
                               <router-link to="/authorization">Стать поставщиком</router-link>
                           </div>
                       </div>
                       <div class="col-xs-12 col-md-3 icon_become_partner_company">
                           <svg width="125" height="114" viewBox="0 0 125 114" fill="none" xmlns="http://www.w3.org/2000/svg">
                               <rect x="-3.80847" y="69.2122" width="23.3106" height="62.6471" rx="10"
                                     transform="rotate(-45 -3.80847 69.2122)" fill="#F0F2F4" />
                               <rect x="110.219" y="10.8149" width="23.3106" height="121.922" rx="10"
                                     transform="rotate(45 110.219 10.8149)" fill="#F0F2F4" />
                           </svg>
                       </div>
                       <div class="col-xs-12 col-md-5">
                           <div class="list_become_partner_company">
                               <ul>
                                   <li>Вы являетесь производителем</li>
                                   <li>Готовность к интеграции учетных систем</li>
                                   <li>Актуализация цен и остатков</li>
                                   <li>Соответствие качества отгружаемой продукции</li>
                                   <li>Достаточное наличие производственных мощностей</li>
                                   <li>Отсутствие "негативной" истории отгрузок</li>
                                   <li>После заполнения формы регистрации и соответствующей проверки к Вам приедет наш
                                       представитель для подписания договора</li>
                               </ul>
                           </div>
                       </div>
                   </div>
               </div>
               <div class="partners_company_block">
                   <div class="title_partners_company_block">Наши партнеры</div>
                   <div class="row" v-if="partners.partners">
                       <div class="col-xs-12 col-md-3 padding_item_partners_company"  v-for="partner in partners.partners">
                           <div class="item_partners_company" :style="'background-image: url(/storage/'+ partner.image + ');background-repeat:no-repeat; background-size:contain;background-position:center;height:100px;'">
<!--                               <div class="img_item_partners_company"
                                    :style="'background-image: url(/storage/'+ partner.image + ');'"></div>-->
<!--                               <div class="name_item_partners_company">{{partner.name}}</div>-->
                           </div>
                       </div>
                   </div>
<!--                   <div class="all_partners_company_block">
                       <a href="">Показать всех</a>
                   </div>-->
               </div>
               <div class="news_company_block">
                   <div class="header_news_company_block">
                       <div class="title_news_company_block">Новости</div>
                       <div class="all_news_company_block"><router-link :to="{path:'allnews'}">Смотреть все</router-link></div>
                   </div>
                   <VueSlickCarousel v-bind="settings" class="list_news" v-if="news.length" >
                      <div class="item_list_news_company" v-for="page in news">
                          <router-link :to="{path:'/news-page/'+page.id}">
                              <div class="img_item_list_news_company" :style="'background-image: url(/storage'+page.image+');'">
                              </div>
                              <div class="title_item_list_news_company">{{page.title}}</div>
                              <div class="category_news_item_list_news_company">
                                  Новости
                              </div>
                          </router-link>

                       </div>
                   </VueSlickCarousel>
               </div>
               <div class="questions_company_block">
                   <div class="row">
                       <div class="col-xs-12 col-md-4 padding_item_questions_company">
                           <div class="item_questions_company">
                               <div class="icon_item_questions_company">
                                   <svg width="26" height="24" viewBox="0 0 26 24" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                       <path
                                           d="M7.00098 2C3.68727 2 1.00098 4.68629 1.00098 8V12C1.00098 12.2403 1.01511 12.4774 1.04259 12.7104C1.01489 12.802 1 12.8993 1 13V21.8258C1 22.6801 2.00212 23.141 2.65079 22.585L7.43827 18.4815C7.80075 18.1708 8.26243 18 8.73985 18H19.001C22.3147 18 25.001 15.3137 25.001 12V8C25.001 4.68629 22.3147 2 19.001 2H7.00098Z"
                                           stroke="#51668F" stroke-width="2" />
                                   </svg>
                               </div>
                               <div class="title_item_questions_company">Возникли трудности?</div>
                               <div class="text_item_questions_company">Свяжитесь с нами по телефону. Мы обязательно поможем
                               </div>
                               <div class="link_item_questions_company"><a href="tel:+8 800 550 71 90">8 800 550 71 90</a>
                               </div>
                           </div>
                       </div>
                       <div class="col-xs-12 col-md-4 padding_item_questions_company">
                           <div class="item_questions_company">
                               <div class="icon_item_questions_company">
                                   <svg width="26" height="24" viewBox="0 0 26 24" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                       <path
                                           d="M1 6C1 4.89543 1.89543 4 3 4H23C24.1046 4 25 4.89543 25 6V19C25 20.1046 24.1046 21 23 21H3C1.89543 21 1 20.1046 1 19V6Z"
                                           stroke="#51668F" stroke-width="2" stroke-linejoin="round" />
                                       <path
                                           d="M2.42131 5.30287C1.91709 4.84067 2.24409 4 2.9281 4H23.0719C23.7559 4 24.0829 4.84067 23.5787 5.30287L15.0272 13.1418C13.8802 14.1931 12.1198 14.1931 10.9728 13.1418L2.42131 5.30287Z"
                                           stroke="#51668F" stroke-width="2" stroke-linejoin="round" />
                                   </svg>
                               </div>
                               <div class="title_item_questions_company">Есть вопросы и предложения?</div>
                               <div class="text_item_questions_company">Напишите нам на почту и мы рассмотрим ваше обращение
                               </div>
                               <div class="link_item_questions_company"><a href="mailto:info@disfood.ru">info@disfood.ru</a>
                               </div>
                           </div>
                       </div>
                       <div class="col-xs-12 col-md-4 padding_item_questions_company">
                           <div class="item_questions_company">
                               <div class="icon_item_questions_company">
                                   <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                       <circle cx="12" cy="12" r="11" stroke="#51668F" stroke-width="2" />
                                       <path d="M12 7V12" stroke="#51668F" stroke-width="2" stroke-linecap="round"
                                             stroke-linejoin="round" />
                                       <path d="M12 16V16.5" stroke="#51668F" stroke-width="2" stroke-linecap="round"
                                             stroke-linejoin="round" />
                                   </svg>
                               </div>
                               <div class="title_item_questions_company">Нашли ошибку?</div>
                               <div class="text_item_questions_company">Неверные данные, неправильное отображение, другие
                                   моменты</div>
                               <div class="link_item_questions_company"><a href="" data-toggle="modal" data-target="#modal_get_consultation">Сообщить об ошибке</a></div>
                           </div>
                       </div>
                   </div>
               </div>
           </div>
        <div id="videoModal" class="modal fade">
            <div class="modal-dialog">
                <div class="modal-content">
                    <div class="modal-body">
                        <button type="button" class="close" data-dismiss="modal" style="color:#fff">&times;</button>
                        <div class="embed-responsive embed-responsive-16by9">
                            <iframe id="cartoonVideo" class="embed-responsive-item" width="100%" height="700" src="//www.youtube.com/embed/F6FIMzpU6yQ" allowfullscreen></iframe>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <!-- Modal -->
        <div class="modal fade modal_consultation" id="modal_get_consultation" tabindex="-1" aria-labelledby="exampleModalLabel"
            style="display: none;" aria-hidden="true">
            <div class="modal-dialog modal-dialog-centered">
                <div class="modal-content">
                    <div class="modal-body">
                        <form action="">
                            <div class="madal_title">Сообщить об ошибке</div>
                            <div class="modal_info">Опишите нам обнаруженную ошибку и мы обязательно ее исправим.</div>
                            <div class="modal_input"><input type="text" placeholder="Имя"></div>
                            <div class="modal_input"><input type="text" placeholder="Email"></div>
                            <div class="modal_input"><input type="text" placeholder="Телефон"></div>
                            <div class="modal_textarea"><textarea placeholder="Расскажите нам об ошибке"></textarea></div>
                            <div class="checkbox register_checkbox">
                                <input class="custom-checkbox" checked type="checkbox" id="color-2" name="color-2"
                                    value="indigo">
                                <label for="color-2">Даю согласие на обработку персональных данных</label>
                            </div>
                            <div><button class="modal_btn_change_price" type="submit">Отправить</button></div>
                        </form>
                    </div>

                </div>
            </div>
        </div>
    </div>
</template>

<script>
import NavbarCatalog from "../Сomponents/NavbarCatalog";
import HeaderCatalog from "../Сomponents/HeaderCatalog";
import VueSlickCarousel from 'vue-slick-carousel'
import 'vue-slick-carousel/dist/vue-slick-carousel.css'
// optional style for arrows & dots
import 'vue-slick-carousel/dist/vue-slick-carousel-theme.css'
import {mapGetters,mapActions,mapState} from 'vuex';
import SearchBar from "../Сomponents/SearchBar";
export default {
    name:'frontpage',
    components:{
        SearchBar,
        NavbarCatalog,
        HeaderCatalog,
        VueSlickCarousel,

    },
    data(){
      return {
          partners:[],
          news:[],
          settings:
          {
              "centerMode": true,
              "centerPadding": "20px",
              "focusOnSelect": true,
              "infinite": true,
              "slidesToShow": 2,
              "speed": 500,
              "arrows":true
          }

      }
    },
    methods:{
      getCats()
      {
          axios.get('/get/partners')
              .then((response) => {

                  if (response.data !== 'undefined' && response.data !== null) {
                      this.partners = response.data;
                  }
              })
          axios.get('/get/news')
              .then((response) => {

                  if (response.data !== 'undefined' && response.data !== null) {
                      this.news = response.data;
                  }
              })
      },
      goToCategory(type)
      {
          //console.log(type)
          //this.updateTypeActionFromFrontPage(type);
          if(this.$route.name !== 'catalog')
          {
              //this.$router.push({'name':'catalog'})
              this.$router.replace({'path':'/catalog/category/'+type.id})
          }

      },
      ...mapActions('catalog',['updateTypeActionFromFrontPage'])
    },
    mounted() {
        this.getCats();
    },
    computed: {
        ...mapState('catalog',['categories'])
    },
}
</script>

<style>
#videoModal
{
    width: 100%;
    height: 100%;
}
#videoModal .modal-dialog .modal-content{
    width:80%;
    margin: 0 auto;
    height: 1000px;
}
#videoModal .modal-dialog{
    max-width: 100%;

}
#videoModal .modal-dialog iframe{
    margin: 0 auto;
    display: block;

}
</style>
